/*
Напишіть програму яка буде приймати два значення, перше це одиниця вимірювання (кілометри, години та кілограми), друге значення це кількість, а потім переводити ці значення:

Кілометри в метри
години в хвилини
Кілограми в грами
Зробити вивід отриманої інформації у вигляді - 10 км це 10000 м. 1 г це 60хв. 1 кг. це 1000 грм. 

Умови виконання ДЗ

В задачі не обов'язково використовувати prompt, просто запишіть значення в зміні
Обов'язково при написані завдання використовуйте switch
Продумати варіант якщо буде введена якась інша одиниця виміру
Мудрувати та створювати валідацію не потрібно
Будь ласка, надайте наступні дані для перевірки вашої роботи:

Додати ДЗ у гілкуjs_homework2
Вислати вашу гілку
*/

var measurement = prompt("Введіть одиницю вимірювання (кілометри, години або кілограми):");
var quantity = Number(prompt("Введіть кількість:"));
var res;
switch (measurement) {
    case 'кілометри':
        res = quantity * 1000;
        console.log(quantity + " км це " + res + " м.");
        break;
    case 'години':
        res = quantity * 60;
        console.log(quantity + " г це " + res + " хв.");
        break;
    case 'кілограми':
        res = quantity * 1000;
        console.log(quantity + " кг це " + res + " грм.");
        break;
    default:
        console.log(`Нажаль, не вдалось перевести значення до "${measurement}". Одиниці вимірювання можуть бути тільки: кілометри, години або кілограми. Спробуйте заново:)`);
}
