/* ДЗ 1
Вам необхідно намалювати в консолі прямокутний трикутник із зірочок (або плюсиків, або якогось іншого символу): на першому рядку - одна зірочка, на другій дві, і так далі. 
Рішення оформіть у вигляді функції, куди передаються два параметри: висота трикутника та символ, яким його потрібно "малювати".
Якось так:
drawTriangle(5, *);
*
**
***
****
*****
Умови виконання ДЗ
•	Домашню роботу необхідно зробити двома способами
•	В задачі не потрібно використовувати prompt або щось інше пов'язане з UI
•	Не використовувати функції або інші матеріали які ми не вивчали
•	Намагайтесь робити ДЗ самостійно та не дивитися будь-які підказки
Будь ласка, надайте наступні дані для перевірки вашої роботи:
•	Створіть гілку js_hw_loops.
•	Додати туди ваше домашнє завдання
•	Вислати вашу гілку
*/

function drawTriangle(height, symbol) {
    for (let row = 1; row < height + 1; row++) {
      let rowContent = "";
      for (let i = 0; i < row; i++) {
        rowContent += symbol;
      }
      console.log(rowContent);
    }
  }
drawTriangle(5, '*');
  
