/* ДЗ 2
Вивести на екран суму чисел від 1 до 100 включно, які не кратні 3.
Умови виконання ДЗ
•	Не використовувати функції або інші матеріали які ми не вивчали
•	Намагайтесь робити ДЗ самостійно та не дивитися будь-які підказки
Будь ласка, надайте наступні дані для перевірки вашої роботи:
•	Створіть гілку js_hw_loops.
•	Додати туди ваше домашнє завдання
•	Вислати вашу гілку
*/


var result = 0;
var numbers = 100;
for (var i = 1; i <= numbers; i++){
    if (i % 3 != 0){
        result += i;
    }
}
console.log(result);
