/*
ДЗ 2

Необхідно написати власну реалізацію функцій padEnd та padStart, але у вас повинна бути одна функція pad(‘qwerty’, ‘+’, 8, true), яка приймає чотири аргументи:

рядок, до якого буде додаватися символ.
символ, який буде додаватися.
Скільки додавати символів
булеве значення, яке вказує, куди додавати символ. Якщо true, то до початку, якщо false, то в кінець.
Останній аргумент повинен працювати як і в оригінальній функції, а саме якщо наш рядок з 5 символів, а ви вказуєте значення 6, то додаєте тільки один символ
Умови виконання ДЗ

Функція повинна повертати новий рядок
Не використовувати функції або інші матеріали які ми не вивчали
Намагайтесь робити ДЗ самостійно та не дивитися будь-які підказки
Будь ласка, надайте наступні дані для перевірки вашої роботи:

Створіть гілку js_homework4.
Додати туди ваше домашнє завдання
Вислати вашу гілку
*/

function pad(string, symbolToAdd, quantityOfSymbolsToAdd, addAtTheBeginning) {
    let finalString = "";
    if (addAtTheBeginning) {
        finalString = string.padStart(quantityOfSymbolsToAdd, symbolToAdd);
    } else {
        finalString = string.padEnd(quantityOfSymbolsToAdd, symbolToAdd);
    }
    return finalString;
}

console.log(pad("qwerty", "+", 7, false));