/*Написати свою реалізацію функції isNaN. 

Умови виконання ДЗ

Не використовувати функції або інші матеріали які ми не вивчали
Намагайтесь робити ДЗ самостійно та не дивитися будь-які підказки
Не використовувати isNaN/ Number.isNaN
Будь ласка, надайте наступні дані для перевірки вашої роботи:

Створіть гілку js_homework4.
Додати туди ваше домашнє завдання
Вислати вашу гілку
*/

function myIsNaN(value) {
    return (typeof value === 'number' && value !== value);
}
console.log(myIsNaN("qwerty" / 10));
