/*ДЗ 1 Без Аа

Напишіть регулярний вираз, який допоможе знайти принаймні шість символів і не містити літери А (великої або малої)

Умови виконання ДЗ

Не використовувати функції або інші матеріали які ми не вивчали
Намагайтесь робити ДЗ самостійно та не дивитися будь-які підказки
Будь ласка, надайте наступні дані для перевірки вашої роботи:

Створіть гілку js_homework7.
Додати туди ваше домашнє завдання
Вислати вашу гілку*/

var str = "Abracadabra 6 and more symbols without a";
var re = /[^A]{6,}/i;
console.log(str.match(re)[0]);